clear all
clc
% fitness学习函数
N  = 80  % N初始化群体个体数目
c1 = 1.8 % c1学习因子1
c2 = 1.8 % c2学习因子2
w  = 0.8 % w惯性权重
bc = 0.8 % bc杂交概率
bs = 0.1 % bs杂交池的大小比例
M  = 100  % M最大迭代次数
D  = 1   % D搜索空间维数

[xm,fm,xn,yn] = PSO_br (@BrF,N,c1,c2,w,bc,bs,M,D);

%得到出计算结果
disp('*************************************************');
disp('目标函数取最小值时的自变量：');
xm
disp('目标函数的最小值为：')
fm
disp('**************************************************');

n = 0:(size(yn,2)-1);
figure(1) % 绘制函数曲线及所拟合的最优解、最优值
fplot(@(x)-11.*sin(7.*x)+7.*cos(3.*x)-5.*sin(6.*x),[-1 11])
hold on
plot(xn,-yn,'r*')
hold off
figure(2) % 绘制各世代的最优值
plot(n,yn)
